cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'cloudfoundry/tap'
tap 'homebrew/bundle'
tap 'homebrew/core'

cask 'adoptopenjdk'

brew 'bash'
brew 'bash-completion'
brew 'cf-cli'
brew 'csshx'
brew 'curl'
brew 'direnv'
brew 'git'
brew 'git-archive-all'
brew 'git-crypt'
brew 'git-flow-avh'
brew 'git-lfs'
brew 'gradle'
brew 'maven'
brew 'pkg-config'
brew 'shellcheck'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'youtube-dl'
brew 'fish'
brew 'terraform'
brew 'cfssl'
brew 'kubectl'

cask '1password'
cask 'cyberduck'
cask 'docker'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'gpg-suite'
cask 'hipchat'
cask 'intellij-idea-ce'
cask 'eclipse-ide'
cask 'keybase'
cask 'sizeup'
cask 'slack'
cask 'spotify'
cask 'vagrant'
cask 'virtualbox'
cask 'whatsapp'
cask 'sublime-text'
cask 'google-cloud-sdk'
